ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp

/* Todo*/
// https://github.com/espressif/arduino-esp32/issues/7779


#include "esp_timer.h" // Include the header for the high-resolution timer
#include "esp_partition.h"

//#define S_CURVE_POSITION_SHAPING

#define ESTIMATE_LOADCELL_VARIANCE_B
//#define PRINT_SERVO_STATES

#define DEBUG_INFO_0_CYCLE_TIMER_U8 1U
#define DEBUG_INFO_0_NET_RUNTIME_U8 2U
// #define DEBUG_INFO_0_LOADCELL_READING 4
#define DEBUG_INFO_0_SERVO_READINGS_U8 8U
#define DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS_U8 16U
#define DEBUG_INFO_0_RESET_SERVO_TO_FACTORY_U8 32U
#define DEBUG_INFO_0_STATE_EXTENDED_INFO_STRUCT_U8 64U
#define DEBUG_INFO_0_LOG_ALL_SERVO_PARAMS_U8 128U


#define EFFECT_SCALING_FACTOR_FL32 4.0f
#define EFFECT_POSITION_SCALING_FACTOR_FL32 0.1f

#define BAUD_3M_U32 3000000U
#define DEFAULT_BAUD_U32 921600U
#include "Arduino.h"
#include "Main.h"
#ifdef CONFIG_IDF_TARGET_ESP32S3
  #include "soc/soc.h"
  #include "soc/rtc_cntl_reg.h"
#endif
Stream *ActiveSerial = nullptr;

#include "Version_Board.h"
#include "PedalInfoBuilder.h"
#ifdef Using_analog_output_ESP32_S3
#include <Wire.h>
#include <Adafruit_MCP4725.h>
  TwoWire MCP4725_I2C= TwoWire(1);
  //MCP4725 MCP(0x60, &MCP4725_I2C);
  Adafruit_MCP4725 dac;
  int current_use_mcp_index;
  bool MCP_status =false;
#endif


#include "FastTrig.h"



//#define ALLOW_SYSTEM_IDENTIFICATION



/**********************************************************************************************/
/*                                                                                            */
/*                         function declarations                                              */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters();
void pedalUpdateTask( void * pvParameters );
void loadcellReadingTask( void * pvParameters );
void profilerTask( void * pvParameters );
void serialCommunicationTaskRx( void * pvParameters );
void serialCommunicationTaskTx( void * pvParameters );
void otaUpdateTask( void * pvParameters );
void espNowCommunicationTaskTx( void * pvParameters);
void miscTask( void * pvParameters);
void configUpdateTask( void * pvParameters );

#ifdef USB_JOYSTICK
  void joystickOutputTask( void * pvParameters );
#endif


#define INCLUDE_vTaskDelete 1
// https://www.tutorialspoint.com/cyclic-redundancy-check-crc-in-arduino
inline uint16_t checksumCalculator_u16(uint8_t * data_pu8, uint16_t length_u16)
{
  uint16_t curr_crc_u16 = 0x0000;
  uint8_t sum1_u8 = (uint8_t) curr_crc_u16;
  uint8_t sum2_u8 = (uint8_t) (curr_crc_u16 >> 8);
  int index_i32;
  for(index_i32 = 0; index_i32 < length_u16; index_i32 = index_i32 + 1)
   {
    sum1_u8 = (sum1_u8 + data_pu8[index_i32]) % 255;
    sum2_u8 = (sum2_u8 + sum1_u8) % 255;
   }
  return (sum2_u8 << 8) | sum1_u8;
}




bool systemIdentificationMode_b = false;
unsigned long saveToEEPRomDuration=0;



bool splineDebug_b = false;



#include <EEPROM.h>
#define EEPROM_OFFSET_U32 15U


#include "ABSOscillation.h"
#include "Rudder.h"
ABSOscillation absOscillation;
RPMOscillation _RPMOscillation;
BitePointOscillation _BitePointOscillation;
GForceEffect gForceEffect_;
WSOscillation _WSOscillation;
RoadImpactEffect roadImpactEffect_;
CustomVibration customVibration1_;
CustomVibration customVibration2_;
CustomVibration customVibration3_;
CustomVibration customVibration4_;
Rudder _rudder;
HelicoptersRudder helicopterRudder_;
RudderGForce rudderGForce_;
MovingAverageFilter averagefilter_joystick(40);



#include "DiyActivePedal_types.h"

DapConfigClass global_dap_config_class;
DRAM_ATTR DapCalculationVariables_t dap_calculationVariables_st;
DapStateBasic_t dap_state_basic_st;
DapStateExtended_t dap_state_extended_st;
DapEspPairing_t dap_esppairing_st;//saving
DapEspPairing_t dap_esppairing_lcl;//sending
DapActionOta_t dap_action_ota_st;//OTA command(do not check version)


/**********************************************************************************************/
/*                                                                                            */
/*                         Oscillation detector                                               */
/*                                                                                            */
/**********************************************************************************************/
#include "OscillationDetector.h"
OscillationDetector oscDetector;

/**********************************************************************************************/
/*                                                                                            */
/*                         Predictive Brake Controller                                        */
/*                                                                                            */
/**********************************************************************************************/
#include "PredictiveBrakeController.h"
PredictiveBrakeController brakeController;

/**********************************************************************************************/
/*                                                                                            */
/*                         iterpolation  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/

#include "ForceCurve.h"
ForceCurveInterpolated forceCurve;



/**********************************************************************************************/
/*                                                                                            */
/*                         multitasking  definitions                                          */
/*                                                                                            */
/**********************************************************************************************/
#ifndef CONFIG_IDF_TARGET_ESP32S3
  #include "rtc_wdt.h"
#endif





