ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    ActiveSerial->println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    ActiveSerial->println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(s_uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif




void setup()
{

  #ifdef DEBUG_KEEP_USB_SERIAL_JTAG
    // For ESP32-S3, the USB Serial is shared with JTAG. To allow debugging via JTAG while also using Serial for output, we can delay the start of Serial until after the debugger has had time to connect.
    // This is a workaround to ensure that the USB Serial doesn't interfere with JTAG debugging during startup. 
    delay(5000); // Gibt dem Debugger 5 Sekunden Zeit, sich in Ruhe zu verbinden!
  #endif

  DapConfig_t dap_config_st_local;
  DapConfig_t dap_config_st_eeprom;

  // setup serial
  // #define USE_CDC_INSTEAD_OF_UART
  #ifdef USE_CDC_INSTEAD_OF_UART
    Serial.begin(DEFAULT_BAUD_U32);
    //Serial.enableReboot(false);
    
    Serial.setTxTimeoutMs(100);
    ActiveSerial = &Serial;
    #ifdef USB_JOYSTICK
      ActiveSerial->println("Setup Controller");
      SetupController();
    #endif
  #elif CONFIG_IDF_TARGET_ESP32S3
    Serial1.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    // Serial.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial1;
  #elif CONFIG_IDF_TARGET_ESP32
    Serial.begin(DEFAULT_BAUD_U32);
    // Serial.begin(BAUD_3M_U32, SERIAL_8N1, 44, 43);
    ActiveSerial = &Serial;
  #endif





  // ADD THIS: Create the queue before creating the tasks that use it.
  // The queue can hold up to N state packages.
  s_pedalStateQueue = xQueueCreate(10, sizeof(PedalStatePackage_t));
  if (s_pedalStateQueue == NULL)
  {
    ActiveSerial->println("Error creating the pedal state queue!");
  }
  s_joystickDataQueue = xQueueCreate(1, sizeof(joystickDataPackage_t));
  if (s_joystickDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the joystick data queue!");
  }
  s_loadcellDataQueue = xQueueCreate(1, sizeof(loadcellDataPackage_t));
  if (s_loadcellDataQueue == NULL)
  {
    ActiveSerial->println("Error creating the joystick data queue!");
  }
  s_configUpdateAvailableQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateAvailableQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToPedalUpdateTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToPedalUpdateTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  s_configUpdateSendToLoadcellTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToLoadcellTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }
  // configUpdateSendToJoystickTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  // if (configUpdateSendToJoystickTaskQueue == NULL) {
  //     ActiveSerial->println("Error creating the config data queue!");
  // }
  s_configUpdateSendToSerialRXTaskQueue = xQueueCreate(1, sizeof(configDataPackage_t));
  if (s_configUpdateSendToSerialRXTaskQueue == NULL)
  {
    ActiveSerial->println("Error creating the config data queue!");
  }



  xTaskCreatePinnedToCore(
                    configHandlingTask,   /* Task function. */
                    "configHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_configHandlingTask,      /* Task handle to keep track of created task */
                    CORE_ID_CONFIG_HANDLING_TASK_U8);          /* pin task to core 1 */  

  

  

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN_U8
    pinMode(BRAKE_RESISTOR_PIN_U8, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN_U8, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN_U8
    pinMode(EMERGENCY_PIN_U8,INPUT_PULLUP);
  #endif

  

  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif

  #ifdef BUZZER_PIN_U8
    Buzzer.initialized(BUZZER_PIN_U8, 1);
  #else
    Buzzer.initialized(1, 1);
  #endif
  Buzzer.single_beep_tone(770, 100);


  parse_version(DAP_FIRMWARE_VERSION, &g_versionMajor, &g_versionMinor, &g_versionPatch);
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  ActiveSerial->println(" ");
  //delay(3000);
  ActiveSerial->println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  ActiveSerial->println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  ActiveSerial->print("Board: ");
  ActiveSerial->println(CONTROL_BOARD);
  ActiveSerial->print("Firmware Version:");
  ActiveSerial->println(DAP_FIRMWARE_VERSION);
  //#endif
  #ifdef PRINT_PARTITION_TABLE
    ActiveSerial->printf("========== Partition Table ==========\n");
    ActiveSerial->printf("| %-10s | %-4s | %-7s | %-8s | %-8s | %-5s |\n", "Name", "Type", "SubType", "Offset", "Size", "Encrypted");
    ActiveSerial->printf("--------------------------------------------------------------------------------\n");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        ActiveSerial->printf("| %-10s | 0x%02x | 0x%02x    | 0x%08x | 0x%08x | %-5s |\n",
               part->label,      
               part->type,       
               part->subtype,    
               part->address,    
               part->size,       
               part->encrypted ? "true" : "false");
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    ActiveSerial->printf("=====================================\n");
  #endif
  
	#ifdef Hardware_Pairing_button
    pinMode(PAIRING_GPIO_U8, INPUT_PULLUP);
  #endif

