ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  #ifdef USING_LED
    pixels.setPixelColor(0,0xff,0x00,0x00);
    pixels.show(); 
  #endif


  // Load config from EEPROM, if valid, overwrite initial config
  EEPROM.begin(2048);
  global_dap_config_class.loadConfigFromEeprom();
  global_dap_config_class.getConfig(&dap_config_st_eeprom, 500);


  // check validity of data from EEPROM  
  bool structChecker = true;
  uint16_t crc;
  if (dap_config_st_eeprom.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_CONFIG_U8)
  {
    structChecker = false;
    /*ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG_U8);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.payloadType_u8);*/
  }
  if (dap_config_st_eeprom.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
  {
    structChecker = false;
    /*ActiveSerial->print("Config version expected: ");
    ActiveSerial->print(DAP_VERSION_CONFIG_U8);
    ActiveSerial->print(",   Config version received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.version_u8);*/
  }
  // checksum validation
  crc = checksumCalculator_u16((uint8_t*)(&(dap_config_st_eeprom.payloadHeader_st)), sizeof(dap_config_st_eeprom.payloadHeader_st) + sizeof(dap_config_st_eeprom.payloadPedalConfig_st));
  if (crc != dap_config_st_eeprom.payloadFooter_st.checkSum_u16)
  {
    structChecker = false;
    /*ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_st.checkSum_u16);*/
  }






  // if checks are successfull, overwrite global configuration struct
  if (structChecker == true)
  {
    ActiveSerial->println("Updating pedal config from EEPROM");
    //global_dap_config_class.setConfig(dap_config_st_local);
    dap_config_st_local = dap_config_st_eeprom;
    configDataPackage_t configPackage_st;
    configPackage_st.config_st = dap_config_st_local;
    // xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

  }
  else
  {

    ActiveSerial->println("Couldn't load config from EPROM due to mismatch: ");

    ActiveSerial->print("Payload type expected: ");
    ActiveSerial->print(DAP_PAYLOAD_TYPE_CONFIG_U8);
    ActiveSerial->print(",   Payload type received: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.payloadType_u8);

    ActiveSerial->print("Target version: ");
    ActiveSerial->print(DAP_VERSION_CONFIG_U8);
    ActiveSerial->print(",    Source version: ");
    ActiveSerial->println(dap_config_st_local.payloadHeader_st.version_u8);

    ActiveSerial->print("CRC expected: ");
    ActiveSerial->print(crc);
    ActiveSerial->print(",   CRC received: ");
    ActiveSerial->println(dap_config_st_local.payloadFooter_st.checkSum_u16);
    //if the config check all failed, reinitialzie _config_st
    ActiveSerial->println("initialized config");
    global_dap_config_class.initializedConfig();
    global_dap_config_class.getConfig(&dap_config_st_local, 500);
  }

  ActiveSerial->println("Config sent successfully");
  // interprete config values
  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  //loadcell
  /*
  #ifdef USES_ADS1220
    //Uses ADS1220
    loadcell = new LoadCellAds1220();

  #else
    //Uses ADS1256
    loadcell = new LoadCellAds1256();
  #endif

  loadcell->setLoadcellRating(dap_config_st_local.payloadPedalConfig_st.loadcellRating_u8);
  loadcell->estimateBiasAndVariance();
  */


  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x5f,0x5f,0x00);//yellow
      pixels.show(); 
      //delay(3000);
  #endif

  bool invMotorDir = dap_config_st_local.payloadPedalConfig_st.invertMotorDirection_u8 > 0;
  stepper = new StepperWithLimits(STEP_PIN_STEPPER_U8, DIR_PIN_STEPPER_U8, invMotorDir, dap_calculationVariables_st.stepsPerMotorRevolution_u32, dap_config_st_local.payloadPedalConfig_st.servoRatioOfInertia_u8, dap_config_st_local.payloadPedalConfig_st.endstopDetectionThreshold_u8); 

  motorRevolutionsPerSteps_fl32 = 1.0f / ( (float)dap_calculationVariables_st.stepsPerMotorRevolution_u32 );
  // ActiveSerial->printf("Steps per motor revolution: %d\n", dap_calculationVariables_st.stepsPerMotorRevolution_u32);

  #ifdef USES_ADS1220
    //Uses ADS1220
    loadcell = new LoadCellAds1220();

  #else
    //Uses ADS1256
    loadcell = new LoadCellAds1256();
  #endif

  loadcell->setLoadcellRating(dap_config_st_local.payloadPedalConfig_st.loadcellRating_u8);
  loadcell->estimateBiasAndVariance();       // automatically identify sensor noise for KF parameterization

	// find the min & max endstops
  ActiveSerial->println("Start homing");
  stepper->findMinMaxSensorless(dap_config_st_local);
  ActiveSerial->print("Min Position is "); ActiveSerial->println(stepper->getLimitMin());
  ActiveSerial->print("Max Position is "); ActiveSerial->println(stepper->getLimitMax());


  // setup Kalman filters
  // ActiveSerial->print("Given loadcell variance: ");
  // ActiveSerial->println(loadcell->getVarianceEstimate(), 5);
  kalman = new KalmanFilter1stOrder(loadcell->getVarianceEstimate());
  kalman_joystick =new KalmanFilter1stOrder(0.1f);
  kalman_2nd_order = new KalmanFilter2ndOrder(loadcell->getVarianceEstimate());


  // LED signal 
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0, 0x80, 0x00, 0x80);//purple
      pixels.show(); 
      //delay(3000);
  #endif

  

  // equalize pedal config for both tasks
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  // send to config handling task
  xQueueSend(s_configUpdateAvailableQueue, &dap_config_st_local, portMAX_DELAY);


  // setup multi tasking
  s_semaphore_updatePedalStates = xSemaphoreCreateMutex();



  delay(10);

  // disableCore0WDT();
  // disableCore1WDT();

  ActiveSerial->println("Starting other tasks");

  // Register tasks
  addScheduledTask(pedalUpdateTask, "pedalUpdateTask", REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US_I64, TASK_PRIORITY_PEDAL_UPDATE_TASK_UBASETYPE, CORE_ID_PEDAL_UPDATE_TASK_U8, 7000);
  addScheduledTask(serialCommunicationTaskRx, "serComRx", REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US_I64, TASK_PRIORITY_SERIALCOMMUNICATION_TASK_UBASETYPE, CORE_ID_SERIAL_COMMUNICATION_TASK_U8, 6000);

  // === Replace hw_timer with esp_timer ===
  const esp_timer_create_args_t periodic_timer_args = {
    .callback = &onTimer,
    .arg = NULL,
    .name = "sched_timer"
  };

  esp_timer_handle_t periodic_timer;
  esp_timer_create(&periodic_timer_args, &periodic_timer);

  // Start periodic timer at BASE_TICK_US interval
  esp_timer_start_periodic(periodic_timer, BASE_TICK_US);


	// the serialCommunicationTaskTx does not need a dedicated timer, since it triggered by queue 
  xTaskCreatePinnedToCore(
      serialCommunicationTaskTx,      /* Task function. */
      "serComTx",    /* name of task. */
      2000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_SERIALCOMMUNICATION_TX_TASK_UBASETYPE,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_serialCommunicationTx,  /* Task handle */
      CORE_ID_SERIAL_COMMUNICATION_TASK_U8); /* pin task to core */

