ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
  // the joystickOutputTask does not need a dedicated timer, since it triggered by queue 
#ifdef USB_JOYSTICK
  xTaskCreatePinnedToCore(
      joystickOutputTask,      /* Task function. */
      "joystickOutputTask",    /* name of task. */
      4000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_JOYSTICKOUTPUT_TASK_UBASETYPE,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_joystickOutput,  /* Task handle */
      CORE_ID_JOYSTICK_TASK_U8); /* pin task to core */
#endif
  // the loadcell task does not need a dedicated timer, since it blocks by DRDY ready ISR
  xTaskCreatePinnedToCore(
                    loadcellReadingTask,   /* Task function. */
                    "loadcellReadingTask",     /* name of task. */
                    1500,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_LOADCELL_READING_TASK_UBASETYPE,           /* priority of the task */
                    &handle_loadcellReadingTask,      /* Task handle to keep track of created task */
                    CORE_ID_LOADCELLREADING_TASK_U8);          /* pin task to core 1 */  

  // xTaskCreatePinnedToCore(
  //                   serialCommunicationTaskRx,   /* Task function. */
  //                   "serialCommunicationTaskRx",          /* name of task. */
  //                   5000,                      /* Stack size of task */
  //                   NULL,                      /* parameter of the task */
  //                   2,                         /* priority of the task */
  //                   &handle_serialCommunicationRx, /* Task handle to keep track of created task */
  //                   CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */
	
  


xTaskCreatePinnedToCore(
                    profilerTask,   /* Task function. */
                    "profilerTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_PROFILER_TASK_UBASETYPE,           /* priority of the task */
                    &handle_profilerTask,      /* Task handle to keep track of created task */
                    CORE_ID_PROFILER_TASK_U8);          /* pin task to core 1 */

  xTaskCreatePinnedToCore(
                    miscTask,   
                    "miscTask", 
                    2000,  
                    NULL,      
                    TASK_PRIORITY_MISC_TASK_UBASETYPE,         
                    &handle_miscTask,    
                    CORE_ID_MISC_TASK_U8);     


                    
 
  #ifdef SERIAL_PATTERN_DETECTOR

    // --- ADD: Create the serialCommunicationTask as a standalone task ---
  // Create the queue to hold incoming serial packets
  s_serial_packet_queue = xQueueCreate(10, sizeof(UartPacket_t)); // Queue can hold 10 packets


  // This prevents the "UART driver already installed" error.
  uart_driver_delete(UART_NUM_0);
  
  // --- MODIFIED: Install driver over the existing UART0 ---
  // Note: This will reconfigure the port used by the Arduino `Serial` object.
  esp_err_t err = uart_driver_install(UART_NUM_0, UART_RX_BUF_SIZE_U32 * 2, 0, 20, &s_uart_queue, 0);
  if (err != ESP_OK) {
    ActiveSerial->printf("Failed to install UART driver: %d\n", err);
    return;
  }

  // Configure UART parameters
  // SERIAL_8N1
  uart_config_t uart_config = {
      .baud_rate = BAUD_3M_U32,
      .data_bits = UART_DATA_8_BITS,
      .parity    = UART_PARITY_DISABLE,
      .stop_bits = UART_STOP_BITS_1,
      .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
      .source_clk = UART_SCLK_XTAL,
  };
  
  // Apply the UART configuration
  uart_param_config(UART_NUM_0, &uart_config);

  // --- NEW: Enable UART pattern detection ---
  #define SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US 100
  uart_enable_pattern_det_baud_intr(UART_NUM_0, EOF_BYTE_1_U8, 1, SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US, 0, 0);

  // Create the task that will handle UART events
  xTaskCreate(
      uart_event_task,    // Task function
      "uart_event_task",  // Name of the task
      4096,               // Stack size
      NULL,               // Task input parameter
      12,                 // Priority of the task
      NULL                // Task handle
  );

  #endif
  



  #if defined(OTA_update)  || defined(OTA_update_ESP32)
    switch(dap_config_st_local.payloadPedalConfig_st.pedalType_u8)
    {
      case 0:
        g_apHost_pc=new char[strlen("FFBPedalClutch") + 1];
        strcpy(g_apHost_pc, "FFBPedalClutch");
        //APhost="FFBPedalClutch";
        break;
      case 1:
        g_apHost_pc=new char[strlen("FFBPedalBrake") + 1];
        strcpy(g_apHost_pc, "FFBPedalBrake");
        //APhost="FFBPedalBrake";
        break;
      case 2:
        g_apHost_pc=new char[strlen("FFBPedalGas") + 1];
        strcpy(g_apHost_pc, "FFBPedalGas");
        //APhost="FFBPedalGas";
        break;
      default:
        g_apHost_pc=new char[strlen("FFBPedal") + 1];
        strcpy(g_apHost_pc, "FFBPedal");
        //APhost="FFBPedal";
        break;        
    }                    
    addScheduledTask(otaUpdateTask, "OTATask", REPETITION_INTERVAL_OTA_TASK_IN_US_I64, TASK_PRIORITY_OTA_TASK_UBASETYPE, CORE_ID_OTA_TASK_U8, 16000);
    delay(200);
  #endif
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
      pixels.show(); 
      //delay(3000);
  #endif

  //print pedal role assignment
  if(dap_config_st_local.payloadPedalConfig_st.pedalType_u8!=PEDAL_ID_UNKNOWN)
  {
    ActiveSerial->print("Pedal Assignment: ");
    ActiveSerial->println(dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
  }
  else
  {
    #ifdef PEDAL_HARDWARE_ASSIGNMENT
      ActiveSerial->println("Pedal Role Assignment:4, reading from CFG pins....");
    #endif
  }
  //enable software assignment reading
  #if defined(PEDAL_SOFTWARE_ASSIGNMENT) && defined(ESPNOW_Enable)
    ActiveSerial->println("Starting software assignment");
    softwareAssignmentInitialize();
    //overwrite the pedal type with device ID
    if (deviceIdStructChecker)
    {
      dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = dap_assignement_reg.deviceId_u8;
    }
    else
    {
      dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = PEDAL_ID_UNKNOWN;
    }
  #endif
  #ifdef PEDAL_HARDWARE_ASSIGNMENT
    pinMode(CFG1_U8, INPUT_PULLUP);
    pinMode(CFG2_U8, INPUT_PULLUP);
    delay(50); // give the pin time to settle
    ActiveSerial->println("Overriding Pedal Role Assignment from Hardware switch......");
    uint8_t CFG1_reading = digitalRead(CFG1_U8);
    uint8_t CFG2_reading = digitalRead(CFG2_U8);
    uint8_t Pedal_assignment = CFG1_reading * 2 + CFG2_reading * 1; // 00=clutch 01=brk  02=gas
    if (Pedal_assignment == PEDAL_ID_ASSIGNMENT_ERROR)
    {
      ActiveSerial->println("Pedal Type:3, assignment error, please adjust dip switch on control board to finish role assignment.");
    }
    else
    {
      if (Pedal_assignment != PEDAL_ID_UNKNOWN)
      {
        // ActiveSerial->print("Pedal Type");
        // ActiveSerial->println(Pedal_assignment);
        if (Pedal_assignment == PEDAL_ID_CLUTCH)
          ActiveSerial->println("Overriding Pedal as Clutch.");
        if (Pedal_assignment == PEDAL_ID_BRAKE)
          ActiveSerial->println("Overriding Pedal as Brake.");
        if (Pedal_assignment == PEDAL_ID_THROTTLE)
          ActiveSerial->println("Overriding Pedal as Throttle.");
        DapConfig_t tmp;
        global_dap_config_class.getConfig(&tmp, 500);
        tmp.payloadPedalConfig_st.pedalType_u8 = Pedal_assignment;
        dap_config_st_local.payloadPedalConfig_st.pedalType_u8 = Pedal_assignment;
        // global_dap_config_class.setConfig(tmp);

