ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
        configDataPackage_t configPackage_st;
        configPackage_st.config_st = tmp;
        xQueueSend(s_configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);
        delay(1000); // delay for writting config into global
      }
      else
      {
        ActiveSerial->println("Asssignment error, defective pin connection, pelase connect USB and send a config to finish assignment");
      }
    }

  #endif

    //enable ESP-NOW
  #ifdef ESPNOW_Enable
    dap_calculationVariables_st.rudderBrakeStatus_b=false;
    ActiveSerial->println("Starting ESP now tasks");
    ESPNow_initialize();
    ActiveSerial->println("ESPNOW initialized, add task in");
    addScheduledTask(espNowCommunicationTaskTx, "ESPNOW_update_Task", REPETITION_INTERVAL_ESPNOW_TASK_IN_US_I64, TASK_PRIORITY_ESPNOW_TASK_UBASETYPE, CORE_ID_ESPNOW_TASK_U8, 10000);
    ActiveSerial->println("ESPNOW task added");
    delay(500);
  #endif

  #if defined(CONTROLLER_SPECIFIC_VIDPID) && defined(USB_JOYSTICK) && !defined(USE_CDC_INSTEAD_OF_UART)
      ActiveSerial->println("Setup Controller");
      SetupController_USB(dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
      delay(500);
  #endif
  #ifdef ESPNOW_Enable
      //print out basic pedal info via espnow
      sendESPNOWLog("Pedal:%d DAP version: %d", dap_config_st_local.payloadPedalConfig_st.pedalType_u8, DAP_VERSION_CONFIG_U8);
      delay(2);
      #ifdef LOWER_WIFI_TRANSMISSION_POWER
        sendESPNOWLog("Pedal:%d WIFI TX Power set to 8.5dBm", dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
        delay(2);
      #endif
      sendESPNOWLog("Pedal:%d Control Board: %s, Firmware: %s", dap_config_st_local.payloadPedalConfig_st.pedalType_u8, CONTROL_BOARD, DAP_FIRMWARE_VERSION);
      delay(2);
      sendESPNOWLog("Pedal:%d Servo Voltage: %.0f V, Rail pitch set to %d mm.",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, (float)stepper->getServosVoltage()/10.0f , dap_config_st_local.payloadPedalConfig_st.spindlePitch_mmPerRev_u8);
      delay(2);
      sendESPNOWLog("Pedal:%d Loadcell shifting: %.3f kg, Stdev: %.4f",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, loadcell->getBiasEstimate(),loadcell->getStandardDeviationEstimate());
      delay(2);
      sendESPNOWLog("Pedal:%d Min pos: %d, Max pos: %d, Current pos: %d",dap_config_st_local.payloadPedalConfig_st.pedalType_u8, stepper->getLimitMin(), stepper->getLimitMax(), stepper->getCurrentPosition());
      delay(2);
      sendESPNOWLog("Pedal:%d Setup end.",dap_config_st_local.payloadPedalConfig_st.pedalType_u8);
  #endif
  ActiveSerial->println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif
  
  // set brake resistor voltage
  float servoOperationVoltageInVolt_fl32 = stepper->getBrakeResistorActivationVoltage();
  brakeController.setVoltageThreshold(servoOperationVoltageInVolt_fl32);


  Buzzer.InitializedSound((int)dap_config_st_local.payloadPedalConfig_st.pedalType_u8);

}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters()
{
  DapConfig_t dap_config_st_local;  
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payloadPedalConfig_st.pedalStartPosition_u8, dap_config_st_local.payloadPedalConfig_st.pedalEndPosition_u8);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  // tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/

void printTaskStats() {
    // Static variables to persist between calls
    static TaskStatus_t *pxPreviousTaskArray = NULL;
    static uint32_t ulPreviousTotalRunTime = 0;
    static UBaseType_t uxPreviousArraySize = 0;

    TaskStatus_t *pxCurrentTaskArray;
    volatile UBaseType_t uxCurrentArraySize;
    uint32_t ulCurrentTotalRunTime;

    // Allocate memory for the current snapshot
    uxCurrentArraySize = uxTaskGetNumberOfTasks();
    pxCurrentTaskArray = (TaskStatus_t *)pvPortMalloc(uxCurrentArraySize * sizeof(TaskStatus_t));

    // Get the current system state
    if (pxCurrentTaskArray != NULL) {
        uxCurrentArraySize = uxTaskGetSystemState(pxCurrentTaskArray, uxCurrentArraySize, &ulCurrentTotalRunTime);

        // Check if this is the first run
        if (pxPreviousTaskArray != NULL) {
            // Calculate the time difference over the last second
            uint32_t ulTotalRunTimeDelta = ulCurrentTotalRunTime - ulPreviousTotalRunTime;

            if (ulTotalRunTimeDelta > 0) {
                ActiveSerial->println("\n--- Task CPU Usage (Last Second) ---");
                ActiveSerial->printf("%-25s %10s %15s %14s %30s\n", "Task", "Core ID", "Runtime [us]", "CPU %", "Free stack space [byte]");

                for (uint8_t coreIdx = 0; coreIdx < 2; coreIdx++)
                {

                  for (UBaseType_t i = 0; i < uxCurrentArraySize; i++) {

                      if (pxCurrentTaskArray[i].xCoreID == coreIdx)
                      {
                        // Find the matching task in the previous snapshot
                        for (UBaseType_t j = 0; j < uxPreviousArraySize; j++) {
                            if (pxCurrentTaskArray[i].xHandle == pxPreviousTaskArray[j].xHandle) {
                                uint32_t ulRunTimeDelta = pxCurrentTaskArray[i].ulRunTimeCounter - pxPreviousTaskArray[j].ulRunTimeCounter;
                                float cpuPercent = (100.0f * (float)ulRunTimeDelta) / (float)ulTotalRunTimeDelta;

                                ActiveSerial->printf("%-25s %10lu %15lu %14.2f %30lu\n",
                                  pxCurrentTaskArray[i].pcTaskName,
                                  pxCurrentTaskArray[i].xCoreID,
                                  (unsigned long)ulRunTimeDelta,
                                  cpuPercent,
                                  pxCurrentTaskArray[i].usStackHighWaterMark);
                                break;
                            }
                        }
                      }
                  }


