ChrGri/DIY-Sim-Racing-FFB-Pedal/ESP32/src/Main.cpp
      // start profiler 0, overall function
      // profiler_joystickOutputTask.start(0);
      // // if new data package is available, update the local config
      // if (xQueueReceive(configUpdateSendToJoystickTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
      //   jut_dap_config_st = configPackage_st.config_st;
      //   // activate profiler depending on pedal config
      //   if (jut_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER) 
      //   {
      //     profiler_joystickOutputTask.activate( true );
      //   }
      //   else
      //   {
      //     profiler_joystickOutputTask.activate( false );
      //   }

      //   ActiveSerial->println("Update config: joystick task");
      // } 


      
      // profiler_joystickOutputTask.start(1);

      uint16_t joystickData_u16 = receivedJoystickData.joystickNormalizedToUInt16;
      bool sendFlag_b = receivedJoystickData.sendJoystickFlag_b;

      if (sendFlag_b)
      {
        // send joystick output
        if (IsControllerReady()) 
        {
          if(dap_calculationVariables_st.rudderStatus_b==false)
          {
            //general output
            // ActiveSerial->printf("joystick: %lu\n", joystickData_u16);
            SetControllerOutputValue(joystickData_u16);
          }
        }
      }

      // profiler_joystickOutputTask.end(1);
      // profiler_joystickOutputTask.end(0);

      // // print profiler results
      // profiler_joystickOutputTask.report();

    }
  }
}
#endif
/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG_U8:
            return sizeof(DapConfig_t);
        case DAP_PAYLOAD_TYPE_ACTION_U8:
            return sizeof(DapActions_t);
        case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:
            return sizeof(DapActionOta_t);
        // Add other packet types here in the future
        default:
            return 0;
    }
}

// NOTE: The IRAM_ATTR attribute has been removed as it is not needed for a FreeRTOS task function.
void IRAM_ATTR_FLAG serialCommunicationTaskRx(void *pvParameters) {
    FunctionProfiler profiler_serialCommunicationTask;
    profiler_serialCommunicationTask.setName("SerialCommunicationRx");
    profiler_serialCommunicationTask.setNumberOfCalls(500);

    static DapConfig_t sct_dap_config_st;

    // Buffer to accumulate incoming serial data
    const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
    static uint8_t rx_buffer[RX_BUFFER_SIZE];
    static size_t buffer_len = 0;

    configDataPackage_t configPackage_st;

    for (;;)
    {
        // Wait for a notification that data might be available
      if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
      {


          // if new data package is available, update the local config
          if (xQueueReceive(s_configUpdateSendToSerialRXTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS)
          {
            sct_dap_config_st = configPackage_st.config_st;

            // activate profiler depending on pedal config
            if (sct_dap_config_st.payloadPedalConfig_st.debugFlags0_u8 & DEBUG_INFO_0_CYCLE_TIMER_U8) 
            {
              profiler_serialCommunicationTask.activate( true );
            }
            else
            {
              profiler_serialCommunicationTask.activate( false );
            }

            ActiveSerial->println("Update config: serial RX");
          } 

          

          // Activate profiler based on config
          profiler_serialCommunicationTask.start(0);

          // --- 1. Read all available data into our buffer ---
            if (ActiveSerial->available())
            {
              // Prevent buffer overflow by only reading what fits
              size_t bytesToRead = min((size_t)ActiveSerial->available(), RX_BUFFER_SIZE - buffer_len);
              if (bytesToRead > 0)
              {
                  ActiveSerial->readBytes(&rx_buffer[buffer_len], bytesToRead);
                  buffer_len += bytesToRead;
              }

              // ActiveSerial->println("Serial data available");
          }

          // --- 2. Process all complete packets in the buffer ---
          size_t buffer_idx = 0;
            while (buffer_idx < buffer_len)
            {
              // A. Find the next valid Start-of-Frame (SOF)
              if (rx_buffer[buffer_idx] != SOF_BYTE_0_U8 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1_U8))
              {
                  buffer_idx++;
                  continue; // Keep scanning for a SOF
              }

              // ActiveSerial->println("1st check passed");

              // SOF found at buffer_idx. Check if we have enough data for a header.
                if (buffer_len < buffer_idx + 3)
                {
                  // Not enough data for a full header, stop parsing for now
                  break;
              }

              // B. Get expected packet size from payload type
              uint8_t payloadType = rx_buffer[buffer_idx + 2];
              size_t expectedSize = getExpectedPacketSize(payloadType);

                if (expectedSize == 0)
                {
                  // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
                  buffer_idx++;
                  continue;
              }

